# just run `brew bundle` command

tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line JSON processing tool
brew "fx"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana", restart_service: true
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# USB multiplexor library for iOS devices
brew "libusbmuxd", args: ["HEAD"]
# Open source relational database management system
brew "mysql"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The Dart SDK
brew "dart-lang/dart/dart"
cask "shiftit"
# iterm2 theme tutorial: https://iterm2colorschemes.com/
cask "iterm2"
cask "alfred"

